Revit 2027 API
RebarContainer.GetRebarContainerIterator Method
 Returns a Rebar Container Iterator that iterates through the Rebar Container Items.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarContainerIterator GetRebarContainerIterator()
Public Function GetRebarContainerIterator As RebarContainerIterator
public:
RebarContainerIterator^ GetRebarContainerIterator()
member GetRebarContainerIterator : unit -> RebarContainerIterator
Return Value
RebarContainerIterator
 A Rebar Container Iterator object that can be used to iterate through Rebar Container Items in the collection.
See Also
Reference
RebarContainer Class
Autodesk.Revit.DB.Structure Namespace